{
  "sobre_mi": {
    "titulo": "Desarrollador Web - Backend Focused",
    "nombre": "Kevin Ponce",
    "descripcion": "Desarrollador web especializado en backend con enfoque en  APIs RESTful. Actualmente estudio Ingeniería Informática y trabajo con tecnologías como Laravel y Node.js. Mi experiencia combina desarrollo robusto en el servidor con interfaces funcionales en el cliente, permitiéndome entregar soluciones completas y bien optimizadas. Apasionado por escribir código limpio y mantener buenas prácticas de desarrollo.",
    "github": "https://github.com/kevinPoncema/",
    "email": "https://github.com/kevinPoncema/",
    "img_src": "/images/foto_fea2.jpg"
  },
  "habilidades": {
    "tecnologias": [
      {
        "nombre": "Laravel",
        "ruta": "/icons/laravel.svg"
      },
      {
        "nombre": "JavaScript",
        "ruta": "/icons/javascript.svg"
      },
      {
        "nombre": "TypeScript",
        "ruta": "/icons/typescript.svg"
      },
      {
        "nombre": "PHP",
        "ruta": "/icons/php.svg"
      },
      {
        "nombre": "Express",
        "ruta": "/icons/express.svg"
      },
      {
        "nombre": "MySQL",
        "ruta": "/icons/mysql.svg"
      },
      {
        "nombre": "GitHub",
        "ruta": "/icons/github.svg"
      },
      {
        "nombre": "Python",
        "ruta": "/icons/python.svg"
      }
    ],
    "blandas": [
      {
        "nombre": "Autodidacta"
      },
      {
        "nombre": "Dedicado"
      },
      {
        "nombre": "Adaptabilidad"
      }
    ]
  },
  "proyectos": [
    {
      "titulo": "Note App",
      "descripcion": "Este proyecto personal es una aplicación web diseñada para gestionar notas y listas de tareas de forma intuitiva y eficiente. Los usuarios pueden crear, editar y eliminar notas con títulos, contenido detallado y fechas, así como gestionar listas de tareas donde cada elemento puede marcarse como completado o pendiente. Además, ofrece la funcionalidad de crear categorías personalizadas, como «Trabajo», «Personal» o «Estudios», permitiendo organizar y filtrar fácilmente las notas y tareas según sus necesidades.",
      "imagen": "/images/projects/notas.webp",
      "tecnologias": ["JavaScript", "Express", "patrón MVC", "EJS"],
      "github": "https://github.com/kevinPoncema/note-app",
      "produccion": "https://notas.kevinponcedev.xyz/"
    },
    {
      "titulo": "Portafolio Personal",
      "descripcion": "Este portafolio personal es una ventana a mi trayectoria profesional, donde muestro mi experiencia laboral, habilidades y proyectos destacados. Cada sección está diseñada para resaltar mi formación, mis logros en el ámbito freelance y mis proyectos más representativos, demostrando mis capacidades como desarrollador. Con un diseño limpio y moderno, este portafolio tiene como objetivo transmitir mis habilidades técnicas y creativas de una manera atractiva y accesible.",
      "imagen": "/images/projects/portafolio.webp",
      "tecnologias": ["JavaScript", "Astro",  "Talwing"],
      "github": "https://github.com/kevinPoncema/portafolio_personal",
      "produccion": "https://kevinponcedev.xyz/"
    },
    {
      "titulo": "File Converter",
      "descripcion": "Este proyecto es una prueba técnica diseñada para demostrar mis habilidades en backend, mi área de especialización, y en frontend, donde, aunque no es mi fuerte, logré desarrollar una interfaz funcional y efectiva.El sistema permite la conversión de archivos entre múltiples formatos, utilizando una API robusta desarrollada en Node.js con librerías especializadas como Pandoc para conversiones avanzadas en entornos Linux. La API está documentada con Swagger para facilitar su exploración y pruebas.En el frontend, implementé una interfaz con Vue 3 y TypeScript, estilizada con TailwindCSS,",
      "imagen": "/images/projects/file_converter.webp",
      "tecnologias": ["JavaScript", "Express", "Swagger", "Vue 3","TailwindCSS","TypeScript"],
      "github": "https://github.com/kevinPoncema/conversor_archivos",
      "produccion": "https://file-converter.kevinponcedev.xyz/"
    },
    {
      "titulo": "Link In Bio App",
      "descripcion": "Un gestor integral de enlaces que permite a los usuarios crear y administrar múltiples perfiles personalizados. Los usuarios pueden agregar enlaces a sus redes sociales y sitios web favoritos, además de personalizar completamente la experiencia visual con temas dinámicos que incluyen colores y fondos personalizables. La aplicación genera una página única y compartible donde todos los enlaces están centralizados, facilitando el compartir la colección completa en redes sociales y otros canales con un único enlace.",
      "imagen": "/images/projects/link_in_bio.webp",
      "tecnologias": ["Laravel", "PHP", "React", "Docker"],
      "github": "https://github.com/kevinPoncema/link-in-bio-app",
      "produccion": "https://link-in-bio.kevinponcedev.xyz/"
    }
  ],
  "experiencia": [
    {
      "date": "Febrero 2025 - Actualidad",
      "title": "Desarrollador Backend",
      "company": "Funiber",
      "description": "Desempeño el rol de desarrollador backend en el equipo fenix de Funiber como parte del programa formativo PROFER. Trabajo con Laravel para el desarrollo y mantenimiento de aplicaciones backend, contribuyendo al crecimiento y mejora continua de los sistemas  de la institución."
    },
    {
      "date": "Octubre 2024 - Diciembre 2024",
      "title": "Desarrollador de Software (Pasantía)",
      "company": "Box HN",
      "description": "Durante mi pasantía, desarrollé una API utilizando PHP y el framework CodeIgniter. La API tenía como objetivo estandarizar la gestión del uso de inteligencia artificial en los productos de la empresa, integrando varios modelos de IA gestionados mediante Ollama en un contenedor Docker. Me encargué de configurar el contenedor, crear la API para interactuar con Ollama e implementar un sistema de créditos para el uso de los modelos de IA."
    },
    {
      "date": "Marzo 2024 - Julio 2024",
      "title": "Automatización de Cierre de Cajeros",
      "company": "Metrocinema Honduras",
      "description": "Lideré el proyecto de automatización del proceso de cierre de cajeros, reduciendo el tiempo necesario para el cierre de caja y minimizando errores manuales. Implementé una solución basada en software que facilitó la conciliación diaria de las transacciones de los cajeros de las salas de cine."
    },
    {
      "date": "Diciembre 2022 - Enero 2023",
      "title": "Desarrollador de Sistema de Inventario y Facturación",
      "company": "Depósito Ponce",
      "description": "Desarrollé un sistema de facturación e inventario que permitió al negocio administrar de manera eficiente sus inventarios de bebidas y emitir recibos para sus clientes. El sistema también generaba reportes en PDF del stock de inventario, los productos más vendidos y las ganancias diarias y mensuales. Utilicé una arquitectura modular, dividiendo el proyecto en varios mini módulos independientes para mejorar la organización y mantenimiento del sistema."
    }
  ],
  "formacion": {
    "profesional": [
      {
        "titulo": "Ingeniería Informática",
        "fecha": "Febrero de 2025 - Actualidad",
        "institucion": "Universidad Europea del Atlántico",
        "lugar": "Santander España"
      },
      {
        "titulo": "Técnico en Programación",
        "fecha": "Enero de 2022 - Diciembre 2024",
        "institucion": "Instituto Tecnológico Excelencia Educativa",
        "lugar": "San Pedro Sula, Honduras"
      }
    ],
    "cursos": [
      {
        "titulo": "Scrum",
        "plataforma": "Scrum Foundation",
        "link": "/Scrum.pdf"
      },
      {
        "titulo": "Colaboración con Git",
        "plataforma": "Microsoft Learn",
        "link": "https://learn.microsoft.com/api/achievements/share/es-es/KevinPonce-7167/24JGWK2V?sharingId=B60F46A0FCD03637"
      },
      {
        "titulo": "Introducción a GitHub",
        "plataforma": "Microsoft Learn",
        "link": "https://learn.microsoft.com/api/achievements/share/es-es/KevinPonce-7167/QD59Y5WE?sharingId=B60F46A0FCD03637"
      },
      {
        "titulo": "GitHub Copilot para empresas",
        "plataforma": "Microsoft Learn",
        "link": "https://learn.microsoft.com/api/achievements/share/es-es/KevinPonce-7167/QD59Y5WE?sharingId=B60F46A0FCD03637"
      },
      {
        "titulo": "Python Essentials 1",
        "plataforma": "Cisco Networking Academy",
        "link": "https://www.credly.com/badges/88712219-7bfb-4a57-9961-f81cf6665a3e/print"
      }
    ]
  },
  "contactos": [
    {
      "icon": "/icons/github.svg",
      "url": "https://github.com/kevinPoncema"
    },
    {
      "icon": "/icons/gemail.svg",
      "url": "mailto:ps12kevin@gmail.com"
    },
    {
      "icon": "/icons/linkedink.svg",
      "url": "https://www.linkedin.com/in/kevin-david-ponce-machigua-75971a320/"
    }
  ]
}